In [1]:
import pandas as pd
df = pd.DataFrame([(1,'Kolter','Zixx'),(2,'Xi','Edde'),(3,'Lee','Marc'),
                   (4,'Mani','Zoulik'),(5,'Gates','Bill'),(6,'Muskk','Eron')],
                 columns=['id','last_name','first_name'])
print(df)

   id last_name first_name
0   1    Kolter       Zixx
1   2        Xi       Edde
2   3       Lee       Marc
3   4      Mani     Zoulik
4   5     Gates       Bill
5   6     Muskk       Eron

In [2]:
df

   id last_name first_name
0   1    Kolter       Zixx
1   2        Xi       Edde
2   3       Lee       Marc
3   4      Mani     Zoulik
4   5     Gates       Bill
5   6     Muskk       Eron

In [3]:
df.set_index("id")

   last_name first_name
id
1     Kolter       Zixx
2         Xi       Edde
3        Lee       Marc
4       Mani     Zoulik
5      Gates       Bill
6      Muskk       Eron

In [4]:
df

   id last_name first_name
0   1    Kolter       Zixx
1   2        Xi       Edde
2   3       Lee       Marc
3   4      Mani     Zoulik
4   5     Gates       Bill
5   6     Muskk       Eron

In [5]:
df.set_index('id', inplace=True)

In [6]:
df

   last_name first_name
id
1     Kolter       Zixx
2         Xi       Edde
3        Lee       Marc
4       Mani     Zoulik
5      Gates       Bill
6      Muskk       Eron

In [11]:
df.loc[1,'last_name']

'Kolter'

In [13]:
df.loc[:,'first_name']

id
1      Zixx
2      Edde
3      Marc
4    Zoulik
5      Bill
6      Eron
Name: first_name, dtype: object

In [14]:
df.loc[:,['last_name']]

   last_name
id
1     Kolter
2         Xi
3        Lee
4       Mani
5      Gates
6      Muskk

In [15]:
df.loc[[1,3],'first_name']

id
1    Zixx
3    Marc
Name: first_name, dtype: object

In [16]:
df.loc[[1,2,3],['first_name']]

   first_name
id
1        Zixx
2        Edde
3        Marc

In [17]:
df.loc[[1,2],:]

   last_name first_name
id
1     Kolter       Zixx
2         Xi       Edde

In [18]:
df.loc[1,'first_name']='Zixxoo'

In [19]:
df

   last_name first_name
id
1     Kolter     Zixxoo
2         Xi       Edde
3        Lee       Marc
4       Mani     Zoulik
5      Gates       Bill
6      Muskk       Eron

In [21]:
df.loc[7,:] = ('Moorsr','Ann')
df

   last_name first_name
id
1     Kolter     Zixxoo
2         Xi       Edde
3        Lee       Marc
4       Mani     Zoulik
5      Gates       Bill
6      Muskk       Eron
7     Moorsr        Ann

In [22]:
df.iloc[0,1]

'Zixxoo'

In [23]:
df.iloc[:,0]

id
1    Kolter
2        Xi
3       Lee
4      Mani
5     Gates
6     Muskk
7    Moorsr
Name: last_name, dtype: object

In [24]:
import sqlite3

In [25]:
conn = sqlite3.connect('database.db')
cursor = conn.cursor()

In [26]:
print(cursor)

<sqlite3.Cursor object at 0x0000028C294DB180>

In [27]:
cursor.execute("""CREATE TABLE person(
                      id INTEGER PRIMARY KEY,
                    last_name TEXT,
                      first_name TEXT);""")

In [28]:
cursor.execute("""
                CREATE TABLE grades(
                person_id INTEGER PRIMARY KEY,
                hw1_grade INTEGER,
                hw2_grade INTEGER);""")
conn.commit()

In [29]:
print(cursor)

<sqlite3.Cursor object at 0x0000028C294DB180>

In [30]:
print(conn)

<sqlite3.Connection object at 0x0000028C2976A110>

In [31]:
cursor.execute("INSERT INTO person VALUES(1,'Kolter','Zico');")
cursor.execute("INSERT INTO person VALUES(2,'Xi','Zic');")
cursor.execute("INSERT INTO person VALUES(3,'Lee','Ma');")
cursor.execute("INSERT INTO person VALUES(4,'Mani','Foco');")
cursor.execute("INSERT INTO person VALUES(5,'Gates','Bill');")
cursor.execute("INSERT INTO person VALUES(6,'Musk','Elon');")

cursor.execute("INSERT INTO grades VALUES(5,85,95);")
cursor.execute("INSERT INTO grades VALUES(6,80,60);")
cursor.execute("INSERT INTO grades VALUES(100,100,100);")

In [32]:
pd.read_sql_query("SELECT * from person;",conn,index_col='id')

   last_name first_name
id
1     Kolter       Zico
2         Xi        Zic
3        Lee         Ma
4       Mani       Foco
5      Gates       Bill
6       Musk       Elon

In [33]:
pd.read_sql_query("SELECT * from grades;",conn)

   person_id  hw1_grade  hw2_grade
0          5         85         95
1          6         80         60
2        100        100        100

In [34]:
pd.read_sql_query("SELECT * from grades;",conn,index_col = 'hw1_grade')

           person_id  hw2_grade
hw1_grade
85                 5         95
80                 6         60
100              100        100

In [35]:
pd.read_sql_query("SELECT id,last_name FROM person WHERE id>=3;",conn,index_col='id')

   last_name
id
3        Lee
4       Mani
5      Gates
6       Musk

In [36]:
cursor.execute("INSERT INTO person VALUES (7,'Moore','Andew');")
pd.read_sql_query("SELECT * from person;",conn,index_col = 'id')

   last_name first_name
id
1     Kolter       Zico
2         Xi        Zic
3        Lee         Ma
4       Mani       Foco
5      Gates       Bill
6       Musk       Elon
7      Moore      Andew

In [37]:
cursor.execute("DELETE FROM person where id = 7;")
pd.read_sql_query("SELECT * from person;",conn,index_col='id')

   last_name first_name
id
1     Kolter       Zico
2         Xi        Zic
3        Lee         Ma
4       Mani       Foco
5      Gates       Bill
6       Musk       Elon

In [39]:
df_person = pd.read_sql_query("SELECT * FROM person",conn)
df_grades = pd.read_sql_query("SELECT * from grades",conn)
df_person.merge(df_grades, how='inner',left_on='id',right_on='person_id')

   id last_name first_name  person_id  hw1_grade  hw2_grade
0   5     Gates       Bill          5         85         95
1   6      Musk       Elon          6         80         60

In [40]:
df_person.set_index('id',inplace=True)
df_grades.set_index('person_id',inplace=True)

In [41]:
df_person.merge(df_grades,how='inner',left_index=True,right_index=True)

  last_name first_name  hw1_grade  hw2_grade
5     Gates       Bill         85         95
6      Musk       Elon         80         60

In [42]:
pd.read_sql_query("SELECT * FROM person, grades WHERE person.id=grades.person_id",conn)

   id last_name first_name  person_id  hw1_grade  hw2_grade
0   5     Gates       Bill          5         85         95
1   6      Musk       Elon          6         80         60

In [43]:
df_person = pd.read_sql_query("SELECT * FROM person",conn)
df_grades = pd.read_sql_query("SELECT * FROM grades",conn)
df_person.merge(df_grades,how='left',left_on='id',right_on='person_id')

   id last_name first_name  person_id  hw1_grade  hw2_grade
0   1    Kolter       Zico        NaN        NaN        NaN
1   2        Xi        Zic        NaN        NaN        NaN
2   3       Lee         Ma        NaN        NaN        NaN
3   4      Mani       Foco        NaN        NaN        NaN
4   5     Gates       Bill        5.0       85.0       95.0
5   6      Musk       Elon        6.0       80.0       60.0

In [44]:
pd.read_sql_query("SELECT * FROM person LEFT JOIN grades ON person.id=grades.person_id",conn)

   id last_name first_name  person_id  hw1_grade  hw2_grade
0   1    Kolter       Zico        NaN        NaN        NaN
1   2        Xi        Zic        NaN        NaN        NaN
2   3       Lee         Ma        NaN        NaN        NaN
3   4      Mani       Foco        NaN        NaN        NaN
4   5     Gates       Bill        5.0       85.0       95.0
5   6      Musk       Elon        6.0       80.0       60.0

In [45]:
df_person.merge(df_grades,how='right',left_on='id',right_on='person_id')

    id last_name first_name  person_id  hw1_grade  hw2_grade
0  5.0     Gates       Bill          5         85         95
1  6.0      Musk       Elon          6         80         60
2  NaN       NaN        NaN        100        100        100

In [46]:
df_person.merge(df_grades,how='outer',left_on='id',right_on='person_id')

    id last_name first_name  person_id  hw1_grade  hw2_grade
0  1.0    Kolter       Zico        NaN        NaN        NaN
1  2.0        Xi        Zic        NaN        NaN        NaN
2  3.0       Lee         Ma        NaN        NaN        NaN
3  4.0      Mani       Foco        NaN        NaN        NaN
4  5.0     Gates       Bill        5.0       85.0       95.0
5  6.0      Musk       Elon        6.0       80.0       60.0
6  NaN       NaN        NaN      100.0      100.0      100.0